
from utils import *


# ------------------------------
# Example: 方程求解 Ax=b。支持含自由变量的解、最小二乘解
# ------------------------------

# mt = [[2,2,2],[4,7,7],[6,18,22]]
# b = [12,24,12]

# mt = [[1,2,-3,4],[4,8,12,-8],[2,3,2,1],[-3,-1,1,-4]]
# b = [3,60,1,5]

# mt = [[1,2,4,17],[3,6,-12,3],[2,3,-3,2],[0,2,-2,6]]
# b = [7,3,3,4]

# mt = [[9,18,-45],[18,42,-90],[-45,-90,375]]
# b = [1.79,3.73,-8.2]

## 含自由变量
mt = [[1,2,3,4,5,6],[2,3,4,5,6,1],[3,4,5,6,1,2]]
b= [1,2,3]

## 无解，返回最小二乘解
# mt = [[1,0,0],[1,0.25,0.0625],[1,0.5,0.25],[1,0.75,0.5625],[1,1,1]]
# b= [0,0.008,0.015,0.019,0.02]

mt = np.array(mt, dtype=np.double)
b = np.array(b, dtype=np.double)

x, fpos = calc_x(mt, b)
if x is not None:
    print('方程的解为：')
    print(x)
    if len(fpos) > 0:
        print('其中自由变量的位置为：')
        print(fpos)

    print('结果验证：')
    print(np.dot(mt, x))

